src/InformationRegisters/бпсЗадачиПоБизнесПроцессам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<InformationRegister>
		<Properties>
			<Name>бпсЗадачиПоБизнесПроцессам</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Рецензия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Согласовано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВыводитьВОтчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Очередь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>БизнесПроцесс</Name>
					<Type>
						<v8:Type>cfg:BusinessProcessRef.бпсСогласование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаБизнесПроцесса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредметСогласования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бпсПредметыСогласований</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ОбъектБД</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИсходныйБизнесПроцесс</Name>
					<Type>
						<v8:Type>cfg:BusinessProcessRef.бпсСогласование</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:TaskRef.бпсЗадача</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/бпсЗадачиПоБизнесПроцессам/Ext/RecordSetModule.bsl
Процедура СформироватьЗаписи(ДопПараметры,Отказ) Экспорт
	Если НЕ ДопПараметры.Свойство("ЗадачаСсылка") Тогда 
		Сообщить("Ошибка! Не все параметры заданы для формирования записей в РС: бпсЗадачиПоБизнесПроцессам");
		Отказ = Истина;
		Возврат;
	Конецесли;
	ЗадачаСсылка = ДопПараметры.ЗадачаСсылка;
	ОбъектБД = Неопределено;
	Если ДопПараметры.Свойство("ОбъектБД") Тогда
		ОбъектБД = ДопПараметры.ОбъектБД;
	Конецесли;
	
	ИсходныйБизнесПроцесс = ПолучитьИсходныйБППоЗадаче(ЗадачаСсылка);
	РезультатФункции = ПолучитьОбъектБДПоИсходномуБП(ИсходныйБизнесПроцесс);
	Если РезультатФункции.НеФормироватьЗаписи Тогда
		Возврат;
	Конецесли;
	
	Если НЕ ЗначениеЗаполнено(ОбъектБД) Тогда
		ОбъектБД = РезультатФункции.ОбъектБД;
	Конецесли;
	
	Если НЕ ЗначениеЗаполнено(ОбъектБД) Тогда
		Отказ = Истина;
		Возврат;
	Конецесли;
	
	ПараметрыДляЗаписи = ПолучитьПараметрыДляЗаписи(ЗадачаСсылка);
	
	НаборЗаписей=РегистрыСведений.бпсЗадачиПоБизнесПроцессам.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ОбъектБД.Установить(ОбъектБД);
	НаборЗаписей.Отбор.ИсходныйБизнесПроцесс.Установить(ИсходныйБизнесПроцесс);
	НаборЗаписей.Отбор.Задача.Установить(ЗадачаСсылка);
	НаборЗаписей.Прочитать();               
	НаборЗаписей.Очистить();
	
	Запись = НаборЗаписей.Добавить();
	Запись.Активность = Истина;
	Запись.ОбъектБД = ОбъектБД;
	Запись.ИсходныйБизнесПроцесс = ИсходныйБизнесПроцесс;
	Запись.Задача = ЗадачаСсылка;
	
	БизнесПроцесс = ЗадачаСсылка.БизнесПроцесс;
	Запись.БизнесПроцесс = БизнесПроцесс;
	Запись.ДатаБизнесПроцесса = БизнесПроцесс.Дата;
	Запись.ПредметСогласования = БизнесПроцесс.ПредметСогласования;
	
	Если ДопПараметры.Свойство("Рецензия") Тогда
		Запись.Рецензия = ДопПараметры.Рецензия;
	Конецесли;
	Если ДопПараметры.Свойство("Согласовано") Тогда
		Запись.Согласовано = ДопПараметры.Согласовано;
	Конецесли;
	Если ДопПараметры.Свойство("Очередь") Тогда
		Запись.Очередь = ДопПараметры.Очередь;
	Конецесли;
	Запись.ВыводитьВОтчет = ПараметрыДляЗаписи.ВыводитьВОтчет;
	НаборЗаписей.Записать();

КонецПроцедуры //СформироватьЗаписи(ЗадачаСсылка)

Функция ПолучитьИсходныйБППоЗадаче(ЗадачаСсылка) 
	ИсходныйБП = ЗадачаСсылка.БизнесПроцесс;
	ВедущаяЗадачаИсходногоБП = ИсходныйБП.ВедущаяЗадача;
	Если ЗначениеЗаполнено(ВедущаяЗадачаИсходногоБП) Тогда
		ИсходныйБП = ПолучитьИсходныйБППоЗадаче(ВедущаяЗадачаИсходногоБП);
	Конецесли;
	Возврат ИсходныйБП;
КонецФункции //ПолучитьИсходныйБППоЗадаче(ЗадачаСсылка)

Функция ПолучитьОбъектБДПоИсходномуБП(ИсходныйБизнесПроцесс) 
	ОбъектБД = Неопределено;
	РезультатФункции = Новый Структура();
	РезультатФункции.Вставить("ОбъектБД",ОбъектБД);
	РезультатФункции.Вставить("НеФормироватьЗаписи",Ложь);
	
	ТипЗнчИсходныйБизнесПроцесс = ТипЗнч(ИсходныйБизнесПроцесс);	
	ОбъектБД = ИсходныйБизнесПроцесс.ОбъектБД;		
	РезультатФункции.Вставить("ОбъектБД",ОбъектБД);
	Возврат РезультатФункции;
КонецФункции //

Функция ПолучитьПараметрыДляЗаписи(ЗадачаСсылка)
	ВыводитьВОтчет = Истина;
	Если ЗадачаСсылка.ТочкаМаршрута = ПредопределенноеЗначение("БизнесПроцесс.бпсСогласование.ТочкаМаршрута.ОбработатьРезультатыСогласования") Тогда
		ВыводитьВОтчет = Ложь;
	КонецЕсли;
	ПараметрыДляЗаписи = Новый Структура();
	ПараметрыДляЗаписи.Вставить("ВыводитьВОтчет",ВыводитьВОтчет);	
	Возврат ПараметрыДляЗаписи;
КонецФункции //ПолучитьЭтоСлужебнаяЗадача(ЗадачаСсылка)
